{
	"navbar": {
		"page": "Pages",
		"title": {
			"principal": "Portfolio",
			"popUp": "Designed by Invision. Coded by Moses!!!!!"
		},
		"links": {
			"about": "About",
			"knowledge": "Skills and Knowledge",
			"calendar": "Calendar",
			"rickAndMorty": "Rick and morty App",
			"checkList": "Check List",
			"NBAPlayers": "NBA Players",
			"Org-chart": "Organizational chart",
			"unfinished": "unfinished"
		},
		"twitter": "Contact me on Twitter ",
		"facebook": "Visit my Facebook ",
		"github": "Look at the repository with the projects ",
		"linkedIn": "Join my network on LinkedIn ",
		"lang": {
			"title": "Language",
			"popUp": "Change the language of the page"
		}
	},
	"profile": {
		"title": "Professional Profile",
		"whoIam": "Who I am?",
		"description": "Born in Venezuela specifically in the Falcón state in 1994, I am passionate about technology that from a very young age, thanks to the work of my parents and a desktop PC with a first-generation Pentium, began his path towards becoming a professional and enthusiastic for the technological innovations that arise every day. ",
		"education": {
			"title": "Higher education",
			"education_line": {
				"1": "Formed at the Universidad de Oriente (2010-2017) as a systems engineer ",
				"2": "with approved thesis in publication mention",
				"3": "project designer according to proven technical, operational and economic feasibility",
				"4": "control information systems and formulating plans and strategies in projects of various magnitudes"
			}
		},
		"professional": {
			"title": "Professional experience",
			"type": "Remote",
			"role": "Role of the position",
			"job1": {
				"position": "Network analyst",
				"description": "In charge of the maintenance and operation of the computer system, as well as the connection of the company's networks and internet."
			},
			"job2": {
				"position": "Web designer",
				"description": "Responsible for the design and implementation of a web application for inventory control with PHP and Laravel framework in oil maintenance works through loop tests."
			},
			"job3": {
				"position": "Technical Support Analyst",
				"description": "Administrator of the electronic equipment and Software involved in the company, maintenance of the servers, support of the payroll and accounting systems of the company."
			},
			"job4": {
				"position": "Automation Engineer",
				"description": "Responsible for the maintenance of the elements associated with the control of fuel gas processing equipment, Administrator of the SCADA real-time visualization systems."
			},
			"job5": {
				"position": "Web Developer (FrontEnd)",
				"description": "In charge of the design and implementation of the structure, interface of parts of the developed application, registration of the data of the forms, sent to the server, requests and filtering."
			}
		}
	},
	"knowledge": {
		"title": "Skills and Knowledge",
		"abilities": {
			"tittle": "Skills",
			"button": {
				"More": "More"
			},
			"frontend": {
				"title": "Frontend development",
				"HTML": {
					"title": "HTML",
					"subtitle": "Version 5",
					"list": {
						"first": "Usage of Tags",
						"second": "Attribute handling",
						"third": "Using and modifying DOM elements with id and class",
						"fourth": "Links or hyperlinks that tell the browser where to go using an href attribute, which stores a URL. ",
						"fifth": "Using the Div container for content divisions",
						"sixth": "Line breaks",
						"seventh": "building ordered and unordered lists to present multiple elements or characteristics",
						"eighth": "Table building to organize more complex information"
					}
				},
				"CSS": {
					"title": "CSS",
					"subtitle": "Versión 3",
					"list": {
						"first": "Using Element Selectors to Modify HTML Tags",
						"second": "Handling id selectors and attribute selectors",
						"third": "Selection of nested 'Child' elements",
						"fourth": "Using the Universal Selector '*' ",
						"fifth": "Use of pseudo selectors"
					}
				},
				"javascript": {
					"title": "Javascript",
					"subtitle": "ECMAScript 9",
					"list": {}
				},
				"angular": {
					"title": "Angular",
					"subtitle": "Version 3",
					"preview": {
						"first": "Management of components, modules, services and interfaces",
						"second": "Use of directives",
						"third": "Building modular applications",
						"fourth": "Design PWA and single page applications",
						"fifth": "Use of lazy loading for decrease time loading"
					},
					"list": {
						"first": "Component creation, nested components: the use of tags, component creation with the CLI, string interpolation, property binding, event binding, two-way data-binding, use of Input and output with their aliases, style encapsulation, local references, viewChild, ng-content use the component's lifecycle and ContendChid methods",
						"second": "The use and creation of directives: I use the ngIf with ng-template, apply styles dynamically with inStyle, apply CSS dynamically with ngClass, Show Lists in ngFor, hostListener and hostBinding for DOM events, Use of ngSwicth",
						"third": "Consumption of Services: inject services into components for data use, use of services for communication between components, creation of methods that call instances injected into components",
						"fourth": "Use of route modules: creation of route modules by CLI definition of the path, redirect, route parameters, creation of nested routes children , the router-outlet, routerLink the use of relative and absolute routes, use of the directives routerLinkActive and routerlinkActiveOptions to apply the correct style to labels, use of the router to navigate from the methods of injected services, use of query parameters and fragments, control access to routes and nested routes with authGuard, verify if the changes in a component are save before leaving the route, dynamic data binding between routes and components, asynchronous routes",
						"fifth": "Observable consumption and subscriptions: creation of custom observables with operators, use of Subjects, use of lazy loading to load only the necessary modules ",
						"sixth": "Creation of forms and reactive forms: recognize the data loaded to the form, use of validators with patterns, modified validators, ng-invalid, ng-touched to disable the loading of erroneous data, add messages to validate the form data, apply values defaults to form inputs, use of two-way data-binding for dynamic data loading, use of validator error codes, use of asynchronous data.",
						"seventh": "Use of pipes and data transformation: creation of pipes by CLI by parameterizing the pipes, custom pipes, asynchronous pipes, search filters, pipes to reduce data load executions"
					}
				}
			}
		}
	},
	"home": {
		"welcome": "Welcome",
		"desc": "A brief walk through the projects in which I have participated",
		"modal": {
			"desc": "A pleasure that you have entered my personal page, this is a project still in development and presents incomplete sections and with bugs, Even so, I hope it is to your liking and if you wish you can contact me in the form below, through my social networks or my email.",
			"close": "close"
		}
	},
	"calendar": {
		"title": "Reactive Calendar",
		"banner": {
			"date": "Date",
			"inputs": "Inputs",
			"about": "About the project ",
			"desc": "Angular, Angular Material, TypeScript, RxJS, Firebase, and AngularFire were used as the core technology to create a fully reactive calendar that works in real time.",
			"search": "Search",
			"add": "Add",
			"view": {
				"title": "View Type",
				"MONTH": "Month",
				"WEEK": "Week",
				"DAY": "Day"
			}
		}
	}
}
